if __name__ == '__main__':

    arrMonths = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима']
    dictMonths = {'1': 'зима', '2': 'зима', '3': 'весна', '4': 'весна', '5': 'весна', '6': 'лето', '7': 'лето', '8': 'лето', '9': 'осень', '10': 'осень', '11': 'осень', '12': 'зима'}

    nMonth = input('Введите номер месяца: ')

    print('{}-й месяц - {}. (через список)'.format(nMonth, arrMonths[int(nMonth) - 1]))

    print('{}-й месяц - {}. (через словарь)'.format(nMonth, dictMonths.get(nMonth)))
